# Q1. How do you load a CSV file into a Pandas DataFrame?

To load a CSV file into a Pandas DataFrame, you can use the read_csv() function provided by the Pandas library

In [24]:
import pandas as pd
#dataframe=pd.read_csv("filename.csv")
df=pd.read_csv("car_data.csv")
df.head()

,mpg,cyl,disp,hp,wt,acc,yr,origin,car_type,car_name
0,18.0,8,307.0,130,3504,12.0,70,1,0,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,0,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,0,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,0,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,0,ford torino

# Q2. How do you check the data type of a column in a Pandas DataFrame?

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   mpg       398 non-null    float64
 1   cyl       398 non-null    int64
 2   disp      398 non-null    float64
 3   hp        398 non-null    object
 4   wt        398 non-null    int64
 5   acc       398 non-null    float64
 6   yr        398 non-null    int64
 7   origin    398 non-null    int64
 8   car_type  398 non-null    int64
 9   car_name  398 non-null    object
dtypes: float64(3), int64(5), object(2)
memory usage: 31.2+ KB

To check the data type of a column in a Pandas DataFrame, you can use the dtype attribute. For example, if you have a DataFrame called df and you want to check the data type of the column my_column,

 df['column_name'].dtype for individual column data type checking
 df.dtypes     for all columns datatype checking

In [28]:
df['car_type'].dtype

dtype('int64')

In [29]:
df.dtypes

mpg         float64
cyl           int64
disp        float64
hp           object
wt            int64
acc         float64
yr            int64
origin        int64
car_type      int64
car_name     object
dtype: object

# Q3. How do you select rows from a Pandas DataFrame based on a condition?

To select rows from a Pandas DataFrame based on a condition, you can use boolean indexing. Boolean indexing allows you to select rows from a DataFrame based on a condition that returns either True or False.

In [31]:
import pandas as pd

# create a sample DataFrame
df1 = pd.DataFrame({'name': ['Alice', 'Bob', 'Charlie', 'Dave'],
                   'age': [25, 32, 41, 28]})

# select rows where age is greater than 30
selected_rows = df1[df1['age'] > 30]

# print the selected rows
print(selected_rows)

      name  age
1      Bob   32
2  Charlie   41

# Q4. How do you rename columns in a Pandas DataFrame?

To rename columns in a Pandas DataFrame, you can use the rename() method.

In [2]:
import pandas as pd

# create a sample DataFrame
df2 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

# print the original DataFrame
print(df2)

# rename the columns
df2 = df2.rename(columns={'A': 'New_A', 'B': 'New_B'})

# print the updated DataFrame
print(df2)

   A  B
0  1  4
1  2  5
2  3  6
   New_A  New_B
0      1      4
1      2      5
2      3      6

In [3]:
df2

   New_A  New_B
0      1      4
1      2      5
2      3      6

In [11]:
df2=df2.rename(columns={'New_A':'aaaaaaa'})

In [15]:
df2

   aaaaaaa  New_B  New_A
0        1      4      1
1        2      5      2
2        3      6      3

# Q5. How do you drop columns in a Pandas DataFrame?

To drop columns in a Pandas DataFrame, you can use the drop() method.

In [25]:
df.head()

,mpg,cyl,disp,hp,wt,acc,yr,origin,car_type,car_name
0,18.0,8,307.0,130,3504,12.0,70,1,0,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,0,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,0,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,0,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,0,ford torino

In [26]:
df.drop(columns=['wt'])

,mpg,cyl,disp,hp,acc,yr,origin,car_type,car_name
0,18.0,8,307.0,130,12.0,70,1,0,chevrolet chevelle malibu
1,15.0,8,350.0,165,11.5,70,1,0,buick skylark 320
2,18.0,8,318.0,150,11.0,70,1,0,plymouth satellite
3,16.0,8,304.0,150,12.0,70,1,0,amc rebel sst
4,17.0,8,302.0,140,10.5,70,1,0,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,15.6,82,1,1,ford mustang gl
394,44.0,4,97.0,52,24.6,82,2,1,vw pickup
395,32.0,4,135.0,84,11.6,82,1,1,dodge rampage
396,28.0,4,120.0,79,18.6,82,1,1,ford ranger
397,31.0,4,119.0,82,19.4,82,1,1,chevy s-10

In [27]:
df

,mpg,cyl,disp,hp,wt,acc,yr,origin,car_type,car_name
0,18.0,8,307.0,130,3504,12.0,70,1,0,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,0,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,0,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,0,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,0,ford torino
...,...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82,1,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,1,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,1,chevy s-10

In [28]:
df.drop(columns=['wt'],inplace=True)

In [29]:
df

,mpg,cyl,disp,hp,acc,yr,origin,car_type,car_name
0,18.0,8,307.0,130,12.0,70,1,0,chevrolet chevelle malibu
1,15.0,8,350.0,165,11.5,70,1,0,buick skylark 320
2,18.0,8,318.0,150,11.0,70,1,0,plymouth satellite
3,16.0,8,304.0,150,12.0,70,1,0,amc rebel sst
4,17.0,8,302.0,140,10.5,70,1,0,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,15.6,82,1,1,ford mustang gl
394,44.0,4,97.0,52,24.6,82,2,1,vw pickup
395,32.0,4,135.0,84,11.6,82,1,1,dodge rampage
396,28.0,4,120.0,79,18.6,82,1,1,ford ranger
397,31.0,4,119.0,82,19.4,82,1,1,chevy s-10

# Q6. How do you find the unique values in a column of a Pandas DataFrame?

To find the unique values in a column of a Pandas DataFrame, you can use the unique() method.

In [36]:
df.head()

,mpg,cyl,disp,hp,acc,yr,origin,car_type,car_name
0,18.0,8,307.0,130,12.0,70,1,0,chevrolet chevelle malibu
1,15.0,8,350.0,165,11.5,70,1,0,buick skylark 320
2,18.0,8,318.0,150,11.0,70,1,0,plymouth satellite
3,16.0,8,304.0,150,12.0,70,1,0,amc rebel sst
4,17.0,8,302.0,140,10.5,70,1,0,ford torino

In [37]:
df.columns

Index(['mpg', 'cyl', 'disp', 'hp', 'acc', 'yr', 'origin', 'car_type',
       'car_name'],
      dtype='object')

In [38]:
df.disp.unique()

array([307. , 350. , 318. , 304. , 302. , 429. , 454. , 440. , 455. ,
       390. , 383. , 340. , 400. , 113. , 198. , 199. , 200. ,  97. ,
       110. , 107. , 104. , 121. , 360. , 140. ,  98. , 232. , 225. ,
       250. , 351. , 258. , 122. , 116. ,  79. ,  88. ,  71. ,  72. ,
        91. ,  97.5,  70. , 120. ,  96. , 108. , 155. ,  68. , 114. ,
       156. ,  76. ,  83. ,  90. , 231. , 262. , 134. , 119. , 171. ,
       115. , 101. , 305. ,  85. , 130. , 168. , 111. , 260. , 151. ,
       146. ,  80. ,  78. , 105. , 131. , 163. ,  89. , 267. ,  86. ,
       183. , 141. , 173. , 135. ,  81. , 100. , 145. , 112. , 181. ,
       144. ])

In [39]:
df['car_type'].unique()

array([0, 1], dtype=int64)

In [40]:
df['car_name'].unique()

array(['chevrolet chevelle malibu', 'buick skylark 320',
       'plymouth satellite', 'amc rebel sst', 'ford torino',
       'ford galaxie 500', 'chevrolet impala', 'plymouth fury iii',
       'pontiac catalina', 'amc ambassador dpl', 'dodge challenger se',
       "plymouth 'cuda 340", 'chevrolet monte carlo',
       'buick estate wagon (sw)', 'toyota corona mark ii',
       'plymouth duster', 'amc hornet', 'ford maverick', 'datsun pl510',
       'volkswagen 1131 deluxe sedan', 'peugeot 504', 'audi 100 ls',
       'saab 99e', 'bmw 2002', 'amc gremlin', 'ford f250', 'chevy c20',
       'dodge d200', 'hi 1200d', 'chevrolet vega 2300', 'toyota corona',
       'ford pinto', 'plymouth satellite custom', 'ford torino 500',
       'amc matador', 'pontiac catalina brougham', 'dodge monaco (sw)',
       'ford country squire (sw)', 'pontiac safari (sw)',
       'amc hornet sportabout (sw)', 'chevrolet vega (sw)',
       'pontiac firebird', 'ford mustang', 'mercury capri 2000',
       'opel 1900', 'peugeot 304', 'fiat 124b', 'toyota corolla 1200',
       'datsun 1200', 'volkswagen model 111', 'plymouth cricket',
       'toyota corona hardtop', 'dodge colt hardtop', 'volkswagen type 3',
       'chevrolet vega', 'ford pinto runabout', 'amc ambassador sst',
       'mercury marquis', 'buick lesabre custom',
       'oldsmobile delta 88 royale', 'chrysler newport royal',
       'mazda rx2 coupe', 'amc matador (sw)',
       'chevrolet chevelle concours (sw)', 'ford gran torino (sw)',
       'plymouth satellite custom (sw)', 'volvo 145e (sw)',
       'volkswagen 411 (sw)', 'peugeot 504 (sw)', 'renault 12 (sw)',
       'ford pinto (sw)', 'datsun 510 (sw)',
       'toyouta corona mark ii (sw)', 'dodge colt (sw)',
       'toyota corolla 1600 (sw)', 'buick century 350',
       'chevrolet malibu', 'ford gran torino', 'dodge coronet custom',
       'mercury marquis brougham', 'chevrolet caprice classic',
       'ford ltd', 'plymouth fury gran sedan',
       'chrysler new yorker brougham', 'buick electra 225 custom',
       'amc ambassador brougham', 'plymouth valiant',
       'chevrolet nova custom', 'volkswagen super beetle', 'ford country',
       'plymouth custom suburb', 'oldsmobile vista cruiser',
       'toyota carina', 'datsun 610', 'maxda rx3', 'mercury capri v6',
       'fiat 124 sport coupe', 'chevrolet monte carlo s',
       'pontiac grand prix', 'fiat 128', 'opel manta', 'audi 100ls',
       'volvo 144ea', 'dodge dart custom', 'saab 99le', 'toyota mark ii',
       'oldsmobile omega', 'chevrolet nova', 'datsun b210',
       'chevrolet chevelle malibu classic', 'plymouth satellite sebring',
       'buick century luxus (sw)', 'dodge coronet custom (sw)',
       'audi fox', 'volkswagen dasher', 'datsun 710', 'dodge colt',
       'fiat 124 tc', 'honda civic', 'subaru', 'fiat x1.9',
       'plymouth valiant custom', 'mercury monarch', 'chevrolet bel air',
       'plymouth grand fury', 'buick century',
       'chevroelt chevelle malibu', 'plymouth fury', 'buick skyhawk',
       'chevrolet monza 2+2', 'ford mustang ii', 'toyota corolla',
       'pontiac astro', 'volkswagen rabbit', 'amc pacer', 'volvo 244dl',
       'honda civic cvcc', 'fiat 131', 'capri ii', 'renault 12tl',
       'dodge coronet brougham', 'chevrolet chevette', 'chevrolet woody',
       'vw rabbit', 'dodge aspen se', 'ford granada ghia',
       'pontiac ventura sj', 'amc pacer d/l', 'datsun b-210', 'volvo 245',
       'plymouth volare premier v8', 'mercedes-benz 280s',
       'cadillac seville', 'chevy c10', 'ford f108', 'dodge d100',
       'honda accord cvcc', 'buick opel isuzu deluxe', 'renault 5 gtl',
       'plymouth arrow gs', 'datsun f-10 hatchback',
       'oldsmobile cutlass supreme', 'dodge monaco brougham',
       'mercury cougar brougham', 'chevrolet concours', 'buick skylark',
       'plymouth volare custom', 'ford granada', 'pontiac grand prix lj',
       'chevrolet monte carlo landau', 'chrysler cordoba',
       'ford thunderbird', 'volkswagen rabbit custom',
       'pontiac sunbird coupe', 'toyota corolla liftback',
       'ford mustang ii 2+2', 'dodge colt m/m', 'subaru dl', 'datsun 810',
       'bmw 320i', 'mazda rx-4', 'volkswagen rabbit custom diesel',
       'ford fiesta', 'mazda glc deluxe', 'datsun b210 gx',
       'oldsmobile cutlass salon brougham', 'dodge diplomat',
       'mercury monarch ghia', 'pontiac phoenix lj',
       'ford fairmont (auto)', 'ford fairmont (man)', 'plymouth volare',
       'amc concord', 'buick century special', 'mercury zephyr',
       'dodge aspen', 'amc concord d/l',
       'buick regal sport coupe (turbo)', 'ford futura',
       'dodge magnum xe', 'datsun 510', 'dodge omni',
       'toyota celica gt liftback', 'plymouth sapporo',
       'oldsmobile starfire sx', 'datsun 200-sx', 'audi 5000',
       'volvo 264gl', 'saab 99gle', 'peugeot 604sl',
       'volkswagen scirocco', 'honda accord lx', 'pontiac lemans v6',
       'mercury zephyr 6', 'ford fairmont 4', 'amc concord dl 6',
       'dodge aspen 6', 'ford ltd landau', 'mercury grand marquis',
       'dodge st. regis', 'chevrolet malibu classic (sw)',
       'chrysler lebaron town @ country (sw)', 'vw rabbit custom',
       'maxda glc deluxe', 'dodge colt hatchback custom', 'amc spirit dl',
       'mercedes benz 300d', 'cadillac eldorado', 'plymouth horizon',
       'plymouth horizon tc3', 'datsun 210', 'fiat strada custom',
       'buick skylark limited', 'chevrolet citation',
       'oldsmobile omega brougham', 'pontiac phoenix',
       'toyota corolla tercel', 'datsun 310', 'ford fairmont',
       'audi 4000', 'toyota corona liftback', 'mazda 626',
       'datsun 510 hatchback', 'mazda glc', 'vw rabbit c (diesel)',
       'vw dasher (diesel)', 'audi 5000s (diesel)', 'mercedes-benz 240d',
       'honda civic 1500 gl', 'renault lecar deluxe', 'vokswagen rabbit',
       'datsun 280-zx', 'mazda rx-7 gs', 'triumph tr7 coupe',
       'ford mustang cobra', 'honda accord', 'plymouth reliant',
       'dodge aries wagon (sw)', 'toyota starlet', 'plymouth champ',
       'honda civic 1300', 'datsun 210 mpg', 'toyota tercel',
       'mazda glc 4', 'plymouth horizon 4', 'ford escort 4w',
       'ford escort 2h', 'volkswagen jetta', 'renault 18i',
       'honda prelude', 'datsun 200sx', 'peugeot 505s turbo diesel',
       'volvo diesel', 'toyota cressida', 'datsun 810 maxima',
       'oldsmobile cutlass ls', 'ford granada gl',
       'chrysler lebaron salon', 'chevrolet cavalier',
       'chevrolet cavalier wagon', 'chevrolet cavalier 2-door',
       'pontiac j2000 se hatchback', 'dodge aries se',
       'ford fairmont futura', 'amc concord dl', 'volkswagen rabbit l',
       'mazda glc custom l', 'mazda glc custom', 'plymouth horizon miser',
       'mercury lynx l', 'nissan stanza xe', 'honda civic (auto)',
       'datsun 310 gx', 'buick century limited',
       'oldsmobile cutlass ciera (diesel)', 'chrysler lebaron medallion',
       'ford granada l', 'toyota celica gt', 'dodge charger 2.2',
       'chevrolet camaro', 'ford mustang gl', 'vw pickup',
       'dodge rampage', 'ford ranger', 'chevy s-10'], dtype=object)

# Q7. How do you find the number of missing values in each column of a Pandas DataFrame?

To find the number of missing values in each column of a Pandas DataFrame, you can use the isna() and sum() methods.

In [41]:
df.head()

,mpg,cyl,disp,hp,acc,yr,origin,car_type,car_name
0,18.0,8,307.0,130,12.0,70,1,0,chevrolet chevelle malibu
1,15.0,8,350.0,165,11.5,70,1,0,buick skylark 320
2,18.0,8,318.0,150,11.0,70,1,0,plymouth satellite
3,16.0,8,304.0,150,12.0,70,1,0,amc rebel sst
4,17.0,8,302.0,140,10.5,70,1,0,ford torino

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   mpg       398 non-null    float64
 1   cyl       398 non-null    int64
 2   disp      398 non-null    float64
 3   hp        398 non-null    object
 4   acc       398 non-null    float64
 5   yr        398 non-null    int64
 6   origin    398 non-null    int64
 7   car_type  398 non-null    int64
 8   car_name  398 non-null    object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.1+ KB

In [43]:
df.isnull().sum()  # zero null values in this data set

mpg         0
cyl         0
disp        0
hp          0
acc         0
yr          0
origin      0
car_type    0
car_name    0
dtype: int64

In [44]:
df.isna().sum()

mpg         0
cyl         0
disp        0
hp          0
acc         0
yr          0
origin      0
car_type    0
car_name    0
dtype: int64

# Q8. How do you fill missing values in a Pandas DataFrame with a specific value?

To fill missing values in a Pandas DataFrame with a specific value, you can use the fillna() method.

In [45]:
import pandas as pd
import numpy as np

# create a sample DataFrame with missing values
df = pd.DataFrame({'A': [1, 2, 3, None], 'B': [4, None, 6, 6], 'C': [7, 8, 9, None]})

# print the original DataFrame
print(df)

# fill missing values with 0
df = df.fillna(0)

# print the updated DataFrame
print(df)

     A    B    C
0  1.0  4.0  7.0
1  2.0  NaN  8.0
2  3.0  6.0  9.0
3  NaN  6.0  NaN
     A    B    C
0  1.0  4.0  7.0
1  2.0  0.0  8.0
2  3.0  6.0  9.0
3  0.0  6.0  0.0

# Q9. How do you concatenate two Pandas DataFrames?

In [1]:
import pandas as pd

# Create two sample DataFrames
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [4, 5, 6], 'B': [7, 8, 9]})

# Concatenate the two DataFrames vertically
result = pd.concat([df1, df2])

print(result)

   A  B
0  1  4
1  2  5
2  3  6
0  4  7
1  5  8
2  6  9

# Q10. How do you merge two Pandas DataFrames on a specific column?

     To merge two Pandas DataFrames on a specific column, you can use the merge() function provided by Pandas. The merge() function combines two DataFrames based on the values of a common column, similar to the SQL JOIN operation.

syntax:
merged_df = pd.merge(df1, df2, on='column_name')

    df1 and df2 are the two DataFrames you want to merge.
    
    'column_name' is the name of the column on which you want to merge the DataFrames.
    
    By default, merge() performs an inner join, which keeps only the matching rows between the DataFrames. If you want to include all rows from both DataFrames, you can specify the how parameter, such as how='left' or how='right'.

In [2]:
import pandas as pd

# Creating two sample DataFrames
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['John', 'Alice', 'Bob']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Age': [25, 30, 35]})

# Merging on the 'ID' column
merged_df = pd.merge(df1, df2, on='ID')

print(merged_df)

   ID   Name  Age
0   2  Alice   25
1   3    Bob   30

    In the above example, the DataFrames df1 and df2 are merged on the 'ID' column, resulting in a new DataFrame merged_df that includes only the matching rows based on the 'ID'.

# Q11. How do you group data in a Pandas DataFrame by a specific column and apply an aggregation function?


    To group data in a Pandas DataFrame by a specific column and apply an aggregation function, you can use the groupby() function provided by Pandas. The groupby() function allows you to split the DataFrame into groups based on a column and perform various aggregations on each group.

In [3]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Category': ['A', 'A', 'B', 'B', 'A', 'B'],
    'Value': [10, 15, 20, 25, 30, 35]
}

df = pd.DataFrame(data)

# Group the data by 'Category' and calculate the sum of 'Value' for each group
grouped_df = df.groupby('Category')['Value'].sum()

print(grouped_df)

Category
A    55
B    80
Name: Value, dtype: int64

    In the above example, we have a DataFrame with two columns: 'Category' and 'Value'. We group the data by the 'Category' column using groupby('Category') and then apply the sum() function to the 'Value' column to calculate the sum of values for each category.

    You can replace sum() with any other aggregation function like mean(), count(), max(), min(), etc., depending on the desired operation you want to perform on the grouped data.

# Q12. How do you pivot a Pandas DataFrame?

    In Pandas, you can pivot a DataFrame using the pivot() function. The pivot() function reshapes the DataFrame by converting unique values from one column into multiple columns, creating a new DataFrame

In [4]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Date': ['2021-01-01', '2021-01-02', '2021-01-01', '2021-01-02'],
    'Category': ['A', 'A', 'B', 'B'],
    'Value': [10, 15, 20, 25]
}

df = pd.DataFrame(data)

# Pivot the DataFrame
pivoted_df = df.pivot(index='Date', columns='Category', values='Value')

print(pivoted_df)

Category     A   B
Date
2021-01-01  10  20
2021-01-02  15  25

    In the above example, we have a DataFrame with three columns: 'Date', 'Category', and 'Value'. We use the pivot() function and specify the column to use as the index (index='Date'), the column to use as the new column headers (columns='Category'), and the column whose values will fill the new columns (values='Value').

    The resulting DataFrame pivoted_df has 'Date' as the index and 'Category' as the columns. The values in the 'Value' column are filled into the respective cells based on the 'Date' and 'Category' combinations.

    Note that if there are duplicate values for the same 'Date' and 'Category' combination, the pivot() function will raise an error. In such cases, you may need to perform some preprocessing or aggregation of the data before pivoting.

# Q13. How do you change the data type of a column in a Pandas DataFrame?

     To change the data type of a column in a Pandas DataFrame, you can use the astype() function or the to_numeric() function. Here's how you can use both methods:

1. Using astype():

In [5]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Column1': [1, 2, 3, 4, 5],
    'Column2': ['A', 'B', 'C', 'D', 'E']
}

df = pd.DataFrame(data)

# Change the data type of 'Column1' to float
df['Column1'] = df['Column1'].astype(float)

print(df.dtypes)

Column1    float64
Column2     object
dtype: object

    In the above example, we have a DataFrame with two columns: 'Column1' and 'Column2'. We use the astype() function to change the data type of 'Column1' to float. The resulting data type can be verified using the dtypes attribute of the DataFrame.
    
2. Using to_numeric():

In [6]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Column1': [1, 2, 3, 4, 5],
    'Column2': ['A', 'B', 'C', 'D', 'E']
}

df = pd.DataFrame(data)

# Change the data type of 'Column1' to float
df['Column1'] = pd.to_numeric(df['Column1'], errors='coerce')

print(df.dtypes)

Column1     int64
Column2    object
dtype: object

    In this example, we use the to_numeric() function to convert the values in 'Column1' to numeric data type. The errors='coerce' argument handles any non-numeric values by converting them to NaN (Not a Number). This allows changing the data type to float.

Both methods provide flexibility in changing the data type of a column to the desired type, such as float, integer, datetime, etc.

# Q14. How do you sort a Pandas DataFrame by a specific column?

To sort a Pandas DataFrame by a specific column, you can use the sort_values() function. Here's an example:

In [7]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Column1': [3, 1, 4, 2, 5],
    'Column2': ['C', 'A', 'D', 'B', 'E']
}

df = pd.DataFrame(data)

# Sort the DataFrame by 'Column1' in ascending order
sorted_df = df.sort_values('Column1')

print(sorted_df)

   Column1 Column2
1        1       A
3        2       B
0        3       C
2        4       D
4        5       E

    In the above example, we have a DataFrame with two columns: 'Column1' and 'Column2'. We use the sort_values() function and specify the column to sort by ('Column1'). By default, sort_values() sorts the DataFrame in ascending order based on the specified column.

If you want to sort the DataFrame in descending order, you can pass the ascending=False parameter to sort_values():

In [8]:
sorted_df = df.sort_values('Column1', ascending=False)

This will sort the DataFrame in descending order based on 'Column1'.

    You can also sort by multiple columns by passing a list of column names to sort_values(). The DataFrame will be sorted first by the first column, and then by the subsequent columns in the specified order. For example:

In [9]:
sorted_df = df.sort_values(['Column1', 'Column2'])

    This will sort the DataFrame by 'Column1' in ascending order and then by 'Column2' in ascending order within each group of 'Column1'.

    By default, sort_values() returns a new DataFrame with the sorted values. If you want to modify the original DataFrame in-place, you can use the inplace=True parameter:

In [10]:
df.sort_values('Column1', inplace=True)

# Q15. How do you create a copy of a Pandas DataFrame?

To create a copy of a Pandas DataFrame, you can use the copy() method.
              Here's an example:

In [11]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Column1': [1, 2, 3, 4, 5],
    'Column2': ['A', 'B', 'C', 'D', 'E']
}

df = pd.DataFrame(data)

# Create a copy of the DataFrame
df_copy = df.copy()

# Modify the copy
df_copy['Column1'] = df_copy['Column1'] * 10

print(df)
print(df_copy)

   Column1 Column2
0        1       A
1        2       B
2        3       C
3        4       D
4        5       E
   Column1 Column2
0       10       A
1       20       B
2       30       C
3       40       D
4       50       E

    In the above example, we create a DataFrame df with two columns: 'Column1' and 'Column2'. We then use the copy() method to create a copy of the DataFrame, stored in df_copy.

    Modifying df_copy does not affect the original DataFrame df. As you can see in the output, the values in 'Column1' of df_copy have been multiplied by 10, while df remains unchanged.

    Creating a copy of a DataFrame allows you to work with the data independently without altering the original DataFrame. It is especially useful when you want to make changes or apply operations to the copy while keeping the original data intact.

# Q16. How do you filter rows of a Pandas DataFrame by multiple conditions?


    To filter rows of a Pandas DataFrame by multiple conditions, you can use the loc[] or boolean indexing. Here's an example using both methods:

In [12]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'London', 'Paris', 'Tokyo', 'Sydney']
}

df = pd.DataFrame(data)

# Filter rows using loc[]
filtered_df = df.loc[(df['Age'] > 30) & (df['City'] == 'London')]

print(filtered_df)

Empty DataFrame
Columns: [Name, Age, City]
Index: []

    In the above example, we have a DataFrame with three columns: 'Name', 'Age', and 'City'. We use the loc[] indexer to filter rows based on multiple conditions. In this case, we filter for rows where the 'Age' column is greater than 30 and the 'City' column is equal to 'London'.

Another method to filter rows by multiple conditions is to use boolean indexing:

In [14]:
filtered_df = df[(df['Age'] > 30) & (df['City'] == 'London')]
filtered_df

Empty DataFrame
Columns: [Name, Age, City]
Index: []

      The df[condition] syntax returns a DataFrame where the specified condition is True. In this example, we use the & operator to combine two conditions. The resulting DataFrame contains rows where both conditions are satisfied.

     You can use various logical operators to combine multiple conditions, such as & (and), | (or), and ~ (not). Parentheses are used to group conditions and maintain the desired precedence.

    Using either loc[] or boolean indexing allows you to filter rows of a DataFrame based on multiple conditions, providing flexibility in data selection and extraction.

# Q17. How do you calculate the mean of a column in a Pandas DataFrame?

    To calculate the mean of a column in a Pandas DataFrame, you can use the mean() function. Here's an example:

In [15]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Column1': [1, 2, 3, 4, 5]
}

df = pd.DataFrame(data)

# Calculate the mean of 'Column1'
column_mean = df['Column1'].mean()

print(column_mean)

3.0

    In the above example, we have a DataFrame with one column called 'Column1'. We use the mean() function on the 'Column1' column to calculate its mean value. The result is stored in the variable column_mean.

    The mean() function returns the average value of the column. It automatically excludes any missing or NaN values from the calculation.

You can also calculate the mean of multiple columns by specifying multiple column names within the square brackets:

    column_means = df[['Column1', 'Column2']].mean()


    
    This will calculate the means of 'Column1' and 'Column2' and return a Series with the mean values for each column.

    By default, the mean() function calculates the arithmetic mean. If you want to calculate other types of means, such as the geometric mean or harmonic mean, you can use the scipy.stats module or other specialized libraries that provide specific mean calculations.

# Q18. How do you calculate the standard deviation of a column in a Pandas DataFrame?

    To calculate the standard deviation of a column in a Pandas DataFrame, use the std() function:

    column_std = df['Column'].std()

Replace 'Column' with the actual column name. The result is the standard deviation value.

In [17]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Column1': [1, 2, 3, 4, 5]
}

df = pd.DataFrame(data)

# Calculate the standard deviation of 'Column1'
column_std = df['Column1'].std()

print(column_std)

1.5811388300841898

# Q19. How do you calculate the correlation between two columns in a Pandas DataFrame?

     To calculate the correlation between two columns in a Pandas DataFrame, you can use the corr() function. Here's an example:

In [18]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Column1': [1, 2, 3, 4, 5],
    'Column2': [2, 4, 6, 8, 10]
}

df = pd.DataFrame(data)

# Calculate the correlation between 'Column1' and 'Column2'
correlation = df['Column1'].corr(df['Column2'])

print(correlation)

0.9999999999999999

    In the above example, we have a DataFrame with two columns: 'Column1' and 'Column2'. We use the corr() function to calculate the correlation between these two columns. The resulting correlation value is stored in the variable correlation.

    The corr() function calculates the Pearson correlation coefficient by default, which measures the linear relationship between two variables. The correlation coefficient ranges from -1 to 1, where 1 represents a perfect positive correlation, -1 represents a perfect negative correlation, and 0 represents no correlation.

    You can also calculate the correlation matrix for multiple columns by passing a DataFrame or a subset of columns to the corr() function:

    correlation_matrix = df[['Column1', 'Column2', 'Column3']].corr()

    This will calculate the correlation coefficients between 'Column1', 'Column2', and 'Column3' and return a correlation matrix DataFrame.

    Note that the corr() function excludes any missing or NaN values pair-wise from the calculation. If you want to include missing values and treat them as NaN, you can use the corr() function with the method='pearson' parameter and min_periods to set the minimum number of valid observations required to compute the correlation:

    correlation = df['Column1'].corr(df['Column2'], method='pearson', min_periods=1)

    This will calculate the correlation while considering missing values as NaN and computing the correlation with at least 1 valid observation.

    Other correlation methods such as Kendall's rank correlation (method='kendall') and Spearman's rank correlation (method='spearman') can also be used with the corr() function.

# Q20. How do you select specific columns in a DataFrame using their labels?

    To select specific columns in a Pandas DataFrame using their labels, you can use the indexing operator [] or the loc[] accessor. Here's an example:

In [19]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Column1': [1, 2, 3, 4, 5],
    'Column2': ['A', 'B', 'C', 'D', 'E'],
    'Column3': [10, 20, 30, 40, 50]
}

df = pd.DataFrame(data)

# Select specific columns using indexing operator []
selected_columns = df[['Column1', 'Column3']]

print(selected_columns)

   Column1  Column3
0        1       10
1        2       20
2        3       30
3        4       40
4        5       50

     In the above example, we have a DataFrame with three columns: 'Column1', 'Column2', and 'Column3'. We use the indexing operator [] and provide a list of column names ['Column1', 'Column3'] to select specific columns. The resulting DataFrame selected_columns contains only the selected columns.

Alternatively, you can use the loc[] accessor to select columns by labels:

In [20]:
selected_columns = df.loc[:, ['Column1', 'Column3']]

    Here, the : in df.loc[:, ['Column1', 'Column3']] indicates that we want to select all rows (:) and the list ['Column1', 'Column3'] specifies the desired column labels.

Both methods allow you to select specific columns by their labels and create a new DataFrame containing only the selected columns.

# Q21. How do you select specific rows in a DataFrame using their indexes?

    To select specific rows in a Pandas DataFrame using their indexes, you can use the loc[] accessor or boolean indexing. Here's an example:

In [21]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Column1': [1, 2, 3, 4, 5],
    'Column2': ['A', 'B', 'C', 'D', 'E'],
    'Column3': [10, 20, 30, 40, 50]
}

df = pd.DataFrame(data, index=['a', 'b', 'c', 'd', 'e'])

# Select specific rows using loc[]
selected_rows = df.loc[['a', 'c', 'e']]

print(selected_rows)

   Column1 Column2  Column3
a        1       A       10
c        3       C       30
e        5       E       50

    In the above example, we have a DataFrame with three columns: 'Column1', 'Column2', and 'Column3', and we set custom row indexes using the index parameter. We use the loc[] accessor and provide a list of row labels ['a', 'c', 'e'] to select specific rows. The resulting DataFrame selected_rows contains only the selected rows.

Alternatively, you can use boolean indexing to select rows based on conditions:

In [23]:
selected_rows = df[df['Column1'] > 3]
print(selected_rows)

   Column1 Column2  Column3
d        4       D       40
e        5       E       50

    This selects rows where the value in 'Column1' is greater than 3. You can customize the condition based on your specific requirements.

Both methods allow you to select specific rows by their indexes or based on certain conditions. The resulting DataFrame will contain only the selected rows.

# Q22. How do you sort a DataFrame by a specific column?

    To sort a Pandas DataFrame by a specific column, you can use the sort_values() function. Here's an example:

In [24]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'London', 'Paris', 'Tokyo', 'Sydney']
}

df = pd.DataFrame(data)

# Sort DataFrame by 'Age' column in ascending order
sorted_df = df.sort_values('Age')

print(sorted_df)

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   40     Tokyo
4      Eve   45    Sydney

    In the above example, we have a DataFrame with three columns: 'Name', 'Age', and 'City'. We use the sort_values() function and specify the column name 'Age' as the parameter to sort the DataFrame by the 'Age' column. By default, the sorting is done in ascending order.

To sort the DataFrame in descending order, you can pass the ascending=False parameter:

In [26]:
sorted_df = df.sort_values('Age', ascending=False)
print(sorted_df)

      Name  Age      City
4      Eve   45    Sydney
3    David   40     Tokyo
2  Charlie   35     Paris
1      Bob   30    London
0    Alice   25  New York

    This will sort the DataFrame by the 'Age' column in descending order.

You can also sort by multiple columns by passing a list of column names to the sort_values() function:

In [27]:
sorted_df = df.sort_values(['Age', 'Name'])
print(sorted_df)

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   40     Tokyo
4      Eve   45    Sydney

    This will sort the DataFrame first by the 'Age' column in ascending order and then by the 'Name' column in ascending order.

     The sort_values() function returns a new sorted DataFrame while leaving the original DataFrame unchanged.

# Q23. How do you create a new column in a DataFrame based on the values of another column?

    To create a new column in a Pandas DataFrame based on the values of another column, you can assign a new column name to the DataFrame indexing operator [] and provide the desired calculation or transformation. Here's an example:

In [28]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 45]
}

df = pd.DataFrame(data)

# Create a new column 'Age_5_years_later' based on the values of the 'Age' column
df['Age_5_years_later'] = df['Age'] + 5

print(df)

      Name  Age  Age_5_years_later
0    Alice   25                 30
1      Bob   30                 35
2  Charlie   35                 40
3    David   40                 45
4      Eve   45                 50

    In the above example, we have a DataFrame with two columns: 'Name' and 'Age'. We create a new column called 'Age_5_years_later' by assigning df['Age'] + 5 to it. This expression performs an element-wise calculation, adding 5 to each value in the 'Age' column.

You can customize the calculation or transformation based on your specific requirements. For example, you can use mathematical operations, apply functions, or combine values from multiple columns to create the new column.

Note that the number of values in the new column should match the number of rows in the DataFrame. If you provide a single value, it will be broadcasted to all rows of the new column.

By assigning a new value to a non-existing column name, Pandas automatically creates the new column and populates it with the assigned values. The original DataFrame is modified in-place with the new column added.

# Q24. How do you remove duplicates from a DataFrame?

To remove duplicates from a Pandas DataFrame, you can use the drop_duplicates() function. Here's an example:

In [29]:
import pandas as pd

# Create a sample DataFrame with duplicates
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'David', 'Bob'],
    'Age': [25, 30, 35, 25, 40, 30]
}

df = pd.DataFrame(data)

# Remove duplicates based on all columns
df_no_duplicates = df.drop_duplicates()

print(df_no_duplicates)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
4    David   40

    In the above example, we have a DataFrame with two columns: 'Name' and 'Age'. We use the drop_duplicates() function to remove duplicates from the DataFrame. By default, it considers all columns when identifying duplicates.

    The resulting DataFrame df_no_duplicates contains only the unique rows, and any duplicates are removed.

You can also specify specific columns to consider when removing duplicates by passing a list of column names to the subset parameter:

In [30]:
df_no_duplicates = df.drop_duplicates(subset=['Name'])
print(df_no_duplicates)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
4    David   40

    In this case, only the 'Name' column is considered when identifying duplicates, and rows with duplicated 'Name' values are removed.

By default, the first occurrence of a duplicated row is kept, and all subsequent occurrences are removed. You can change this behavior by specifying the keep parameter. For example, to keep the last occurrence and remove all previous duplicates:

In [31]:
df_no_duplicates = df.drop_duplicates(keep='last')
print(df_no_duplicates)

      Name  Age
2  Charlie   35
3    Alice   25
4    David   40
5      Bob   30

This will keep the last occurrence of each duplicated row and remove the rest.

The drop_duplicates() function returns a new DataFrame with duplicates removed, while leaving the original DataFrame unchanged.

# Q25. What is the difference between .loc and .iloc in Pandas?

In Pandas, both .loc and .iloc are used for indexing and selecting data in a DataFrame or Series, but they differ in how they reference and access the data.

.loc is primarily label-based and is used to access data by specifying explicit labels of rows and columns. It allows you to use meaningful index labels or column names to perform data selection. Here are a few examples of using .loc:

In [ ]:
# Access a single value
df.loc[row_label, column_label]

# Access a row
df.loc[row_label]

# Access multiple rows
df.loc[start_label:end_label]

# Access specific rows and columns
df.loc[row_label_1:row_label_2, column_label_1:column_label_2]

# Access rows based on a condition
df.loc[df['column'] > value]

    On the other hand, .iloc is primarily integer-based and is used for accessing data by specifying integer-based positions of rows and columns. It is useful when you want to select data using integer-based indexing, regardless of the label values. Here are a few examples of using .iloc:

In [ ]:
# Access a single value
df.iloc[row_index, column_index]

# Access a row
df.iloc[row_index]

# Access multiple rows
df.iloc[start_index:end_index]

# Access specific rows and columns
df.iloc[row_index_1:row_index_2, column_index_1:column_index_2]

    In summary, the main difference between .loc and .iloc is the way they reference and access data. .loc uses label-based indexing, while .iloc uses integer-based indexing. Use .loc when you want to access data using labels, and use .iloc when you want to access data using integer positions